In [24]:
import pandas as pd
import numpy as np

data = {'Nome': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
        'Età': [25, 30, 35, 40, 22],
        'Sesso': ['F', 'M', 'M', 'M', 'F'],
        'Punteggio': [85, 90, 88, 92, 78]}

df = pd.DataFrame(data)
df

      Nome  Età Sesso  Punteggio
0    Alice   25     F         85
1      Bob   30     M         90
2  Charlie   35     M         88
3    David   40     M         92
4     Emma   22     F         78

In [25]:
# 1. Seleziona solo la colonna 'Nome'
df['Nome']

0      Alice
1        Bob
2    Charlie
3      David
4       Emma
Name: Nome, dtype: object

In [26]:
# 2. Seleziona le colonne 'Nome' e 'Età'
df[['Nome', 'Età']]

      Nome  Età
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4     Emma   22

In [27]:
# 3. Filtra le righe dove l'età è superiore a 30
df[df['Età'] > 30]

      Nome  Età Sesso  Punteggio
2  Charlie   35     M         88
3    David   40     M         92

In [28]:
# 4. Aggiungi una nuova colonna chiamata 'Voto' con valori casuali tra 60 e 100
import numpy as np
df['Voto'] = np.random.randint(60, 101, len(df)) # df.shape[0]
df

      Nome  Età Sesso  Punteggio  Voto
0    Alice   25     F         85    95
1      Bob   30     M         90    88
2  Charlie   35     M         88   100
3    David   40     M         92    96
4     Emma   22     F         78    71

In [29]:
# 5. Ordina il DataFrame in base alla colonna 'Punteggio' in ordine decrescente
df.sort_values(by='Punteggio', ascending=False)

      Nome  Età Sesso  Punteggio  Voto
3    David   40     M         92    96
1      Bob   30     M         90    88
2  Charlie   35     M         88   100
0    Alice   25     F         85    95
4     Emma   22     F         78    71

In [30]:
# 6. Calcola la media dei punteggi
df['Punteggio'].mean()

np.float64(86.6)

In [31]:
# 7. Trova la persona con il punteggio massimo
df['Punteggio'].idxmax() #row id with max value of series
df.loc[df['Punteggio'].idxmax()]

Nome         David
Età             40
Sesso            M
Punteggio       92
Voto            96
Name: 3, dtype: object

In [32]:

# 8. Cambia il sesso di 'Alice' a 'test'
df.loc[df['Nome'] == 'Alice', 'Sesso'] = 'test'
df

      Nome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    95
1      Bob   30     M         90    88
2  Charlie   35     M         88   100
3    David   40     M         92    96
4     Emma   22     F         78    71

In [33]:
# 9. Conta il numero di persone per sesso
df['Sesso'].value_counts()

Sesso
M       3
test    1
F       1
Name: count, dtype: int64

In [34]:
# 10. Rimuovi la colonna 'Voto'
df.drop('Voto', axis=1)

      Nome  Età Sesso  Punteggio
0    Alice   25  test         85
1      Bob   30     M         90
2  Charlie   35     M         88
3    David   40     M         92
4     Emma   22     F         78

In [35]:
# 11. Calcola la somma cumulativa della colonna 'Età'
df['Età'].cumsum()

0     25
1     55
2     90
3    130
4    152
Name: Età, dtype: int64

In [36]:
# 12. Trova le persone con punteggio superiore a 80 e età inferiore a 35
df[(df['Punteggio'] > 80) & (df['Età'] < 35)]

    Nome  Età Sesso  Punteggio  Voto
0  Alice   25  test         85    95
1    Bob   30     M         90    88

In [37]:
# 13. Calcola la deviazione standard della colonna 'Punteggio'
df['Punteggio'].std()

np.float64(5.458937625582473)

In [38]:
# 14. Raggruppa il DataFrame per sesso e calcola la media delle età
df.groupby('Sesso')['Età'].mean()

Sesso
F       22.0
M       35.0
test    25.0
Name: Età, dtype: float64

In [39]:
# 15. Rinomina la colonna 'Nome' in 'Cognome'
df = df.rename(columns={'Nome': 'Cognome'})
df

   Cognome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    95
1      Bob   30     M         90    88
2  Charlie   35     M         88   100
3    David   40     M         92    96
4     Emma   22     F         78    71

In [40]:
# 16. Fai una fusione (merge) con un secondo DataFrame
data2 = {'Cognome': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
         'Lavoro': ['Ingegnere', 'Analista', 'Manager', 'Programmatore', 'Designer']}
df2 = pd.DataFrame(data2)
df2

   Cognome         Lavoro
0    Alice      Ingegnere
1      Bob       Analista
2  Charlie        Manager
3    David  Programmatore
4     Emma       Designer

In [41]:
pd.merge(df, df2, on='Cognome')

   Cognome  Età Sesso  Punteggio  Voto         Lavoro
0    Alice   25  test         85    95      Ingegnere
1      Bob   30     M         90    88       Analista
2  Charlie   35     M         88   100        Manager
3    David   40     M         92    96  Programmatore
4     Emma   22     F         78    71       Designer

In [42]:
# 17. Salva il DataFrame in un file CSV
df.to_csv('dati.csv', index=False)

In [43]:
# 18. Carica un DataFrame da un file CSV
df_caricato = pd.read_csv('dati.csv')
df_caricato

   Cognome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    95
1      Bob   30     M         90    88
2  Charlie   35     M         88   100
3    David   40     M         92    96
4     Emma   22     F         78    71

In [44]:
# 19. Aggiungi una riga al DataFrame
nuova_riga = {'Cognome': 'Frank', 'Età': 28, 'Sesso': 'M', 'Punteggio': 75, 'Voto': 89}
df = pd.concat([df, pd.DataFrame([nuova_riga])], ignore_index=True)
df

   Cognome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    95
1      Bob   30     M         90    88
2  Charlie   35     M         88   100
3    David   40     M         92    96
4     Emma   22     F         78    71
5    Frank   28     M         75    89